Table of Contents
 Class IdeaLineSegment3D
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaLineSegment3D : AbstractIdeaObject<IIdeaLineSegment3D>, IEquatable<AbstractIdeaObject<IIdeaLineSegment3D>>, IIdeaLineSegment3D, IIdeaSegment3D, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaLineSegment3D>
IdeaLineSegment3D
Implements
IEquatable<AbstractIdeaObject<IIdeaLineSegment3D>>
IIdeaLineSegment3D
IIdeaSegment3D
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaLineSegment3D>.Id
 AbstractIdeaObject<IIdeaLineSegment3D>.Name
 AbstractIdeaObject<IIdeaLineSegment3D>.Identifier
 AbstractIdeaObject<IIdeaLineSegment3D>.GetHashCode()
 AbstractIdeaObject<IIdeaLineSegment3D>.Equals(object)
 AbstractIdeaObject<IIdeaLineSegment3D>.Equals(AbstractIdeaObject<IIdeaLineSegment3D>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaLineSegment3D(Identifier<IIdeaLineSegment3D>)
public IdeaLineSegment3D(Identifier<IIdeaLineSegment3D> identifer)
Parameters
identifer Identifier<IIdeaLineSegment3D>
 IdeaLineSegment3D(int)
public IdeaLineSegment3D(int id)
Parameters
id int
 IdeaLineSegment3D(string)
public IdeaLineSegment3D(string id)
Parameters
id string
Properties
 EndNode
End node of the segment. Returns the same value as end node of the owned element. Must not be equal to StartNode.
public virtual IIdeaNode EndNode { get; set; }
Property Value
IIdeaNode
 LocalCoordinateSystem
Local Coordinate System (LCS) of the segment. Only vector definition of the LCS is supported, so the instance of IdeaRS.OpenModel.Geometry3D.CoordSystemByVector must be returned. LCS only effects rotation of the segment, it does not modify on nodes' position.
public virtual CoordSystem LocalCoordinateSystem { get; set; }
Property Value
CoordSystem
 StartNode
Start node of the segment. Returns the same value as start node of the owned element. Must not be equal to EndNode.
public virtual IIdeaNode StartNode { get; set; }
Property Value
IIdeaNode
 Edit this page